Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Configure and install GTest using
it_it: Configurare e installare GTest con

source: Congratulations!
it_it: Congratulazioni!

source: Consecutive calls will return the same object.
it_it: Le chiamate consecutive restituiranno lo stesso oggetto.

source: Consider extracting an implementation class, and testing it.
it_it: Si prenda in considerazione l'estrazione di una classe di implementazione e la si testi.

source: Consider the following code:
it_it: Si consideri il seguente codice:

source: Consider the prototype for a simple square root function shown in Listing 1.
it_it: Si consideri il prototipo di una semplice funzione radice quadrata mostrato nel Listato 1.

source: Const Method
it_it: Metodo Const

source: Const Method in a Class Template
it_it: Metodo Const in una Classe Template

source: Const Method with Call Type
it_it: Metodo Const con una [Call Type]

source: Const Method with Call Type in a Class Template
it_it: Metodo Const con una [Call Type] in una Classe Template

source: Container Matchers
it_it: Matcher di Contenitori

source: Contains information about the result of a single test.
it_it: Contiene informazioni sul risultato di un singolo test.

source: Contains the fields param and index which hold the value of the parameter and its integer index respectively.
it_it: Contiene i campi param e index che contengono rispettivamente il valore del parametro e il suo indice intero.

source: Contains the fields `param` and `index` which hold the value of the parameter and its integer index respectively.
it_it: Contiene i campi `param` e `index` che contengono rispettivamente il valore del parametro e il suo indice intero.

source: Contents:
it_it: Contenuto:

source: Contrary to a lot of other testing frameworks, Google's test framework has built-in assertions that are deployable in software where exception handling is disabled (typically for performance reasons).
it_it: Contrariamente a molti altri framework di test, quello di Google ha asserzioni integrate che possono essere implementate in software in cui la gestione delle eccezioni è disabilitata (in genere per motivi prestazionali).

source: Controlling How Failures Are Reported
it_it: Controllare Come Vengono Riportati gli Errori

source: Controlling How Much Information gMock Prints
it_it: Controllare la Quantità di Informazioni che Scrive gMock

source: Controlling Test Output
it_it: Controllo dell'Output del Test

source: Controlling When an Expectation Retires
it_it: Controllare Quando una Expectation viene Ritirata

source: Copies the elements in source range [first, last) to the array pointed to by the N-th (0-based) argument, which can be either a pointer or an iterator.
it_it: Copia gli elementi nell'intervallo di origine [first, last) nell'array puntato dall'argomento N-esimo (in base 0), che può essere un puntatore o un iteratore.

source: Copies the elements in source range [`first`, `last`) to the array pointed to by the `N`-th (0-based) argument, which can be either a pointer or an iterator.
it_it: Copia gli elementi nell'intervallo di origine [`first`, `last`) nell'array puntato dall'argomento `N`-esimo (in base 0), che può essere un puntatore o un iteratore.

source: Copying matchers is allowed and very efficient, as only the pointer is copied.
it_it: La copia dei matcher è consentita ed è molto efficiente, poiché viene copiato solo il puntatore.

source: Create a mock object foo.
it_it: Si crea un oggetto mock foo.

source: Create a mock object `foo`.
it_it: Si crea un oggetto mock `foo`.

source: Create a mock object.
it_it: Crea un oggetto mock.

source: Create and run a binary
it_it: Crea ed eseguire un file binario

source: Create some mock objects.
it_it: Si creano degli oggetti mock.

source: Create the mock objects.
it_it: Si creano gli oggetti mock.

source: Creates a failed assertion result.
it_it: Crea un risultato di asserzione non riuscita

source: Creates a successful assertion result.
it_it: Crea un risultato di asserzione corretta.

source: Creates a test fixture object for the first test.
it_it: Crea un oggetto fixture per il primo test.

source: Creates an expectation that the method method_name of the object mock_object is called with arguments that match the given matchers matchers....
it_it: Crea una expectation (aspettativa) che il metodo method_name dell'oggetto mock_object venga chiamato con argomenti che coincidano con i corrispondenti matchers....

source: Creates an [expectation](../gmock_for_dummies.md#setting-expectations) that the method *`method_name`* of the object *`mock_object`* is called with arguments that match the given matchers *`matchers...`*.
it_it: Crea una [expectation](../gmock_for_dummies.md#setting-expectations) (aspettativa) che il metodo *`method_name`* dell'oggetto *`mock_object`* venga chiamato con argomenti che coincidano con i corrispondenti *`matchers...`*.

source: Creating Mock Classes
it_it: Creare Classi Mock

source: Creating Value-Parameterized Abstract Tests
it_it: Creazione di Test Astratti con Valori Parametrizzati

source: Creating a basic test
it_it: Creazione di un test di base

source: Currently TEST(TestSuiteName, TestName) generates a class named TestSuiteName_TestName_Test.
it_it: Attualmente TEST(TestSuiteName, TestName) genera una classe denominata TestSuiteName_TestName_Test.

source: Currently `TEST(TestSuiteName, TestName)` generates a class named `TestSuiteName_TestName_Test`.
it_it: Attualmente `TEST(TestSuiteName, TestName)` genera una classe denominata `TestSuiteName_TestName_Test`.

source: Currently, an uninteresting call will also by default cause gMock to print a warning.
it_it: Attualmente, una chiamata non interessante farà sì che gMock stampi un warning per default.

source: Currently, the flag's default value is "fast".
it_it: Attualmente, il valore di default del flag è "fast".

source: Currently, the flag's default value is **`"fast"`**.
it_it: Attualmente, il valore di default del flag è **`"fast"`**.

source: DO NOT suppress it by blindly adding an EXPECT_CALL(...), or you'll have a test that's a pain to maintain.
it_it: NON sopprimerlo aggiungendo ciecamente un EXPECT_CALL(...)altrimenti il test sarà difficile da manutenere.

source: DO NOT suppress it by blindly adding an `EXPECT_CALL(...)`, or you'll have a test that's a pain to maintain.
it_it: NON sopprimerlo aggiungendo ciecamente un `EXPECT_CALL(...)`, altrimenti il test sarà difficile da manutenere.

source: Dealing with unprotected commas
it_it: Trattare le virgole non protette

source: Death Assertions {#death}
it_it: Asserzioni Death {#death}

source: Death Test Naming
it_it: Nomenclatura del Death Test

source: Death Test Styles
it_it: Stili dei Death Test

source: Death Tests
it_it: I Death Test

source: Death Tests And Threads
it_it: I Death Test E i Thread

source: Death tests
it_it: I death test

source: Death tests (EXPECT_DEATH, etc.) are executed in a sub-process s.t.
it_it: I death test (EXPECT_DEATH, ecc.) vengono eseguiti in un sottoprocesso s.t.

source: Death tests (`EXPECT_DEATH`, etc.) are executed in a sub-process s.t.
it_it: I death test (`EXPECT_DEATH`, ecc.) vengono eseguiti in un sottoprocesso s.t.

source: Default Action
it_it: Action di Default

source: DefaultValue<T>::Set(value); // Sets a factory.
it_it: DefaultValue<T>::Set(value); // Setta una factory.

source: Defines a matcher IsBetween(a, b) to match a value in the range a, b.
it_it: Definisce un matcher IsBetween(a, b) per far corrispondere un valore nell'intervallo a, b.

source: Defines a matcher IsDivisibleBy(n) to match a number divisible by n.
it_it: Definisce un matcher IsDivisibleBy(n) per trovare la corrispondenza con un numero divisibile per n.

source: Defines a matcher IsEven() to match an even number.
it_it: Definisce un matcher IsEven() per abbinare un numero pari.

source: Defines a matcher `IsBetween(a, b)` to match a value in the range [`a`, `b`].
it_it: Definisce un matcher `IsBetween(a, b)` per far corrispondere un valore nell'intervallo [`a`, `b`].

source: Defines a matcher `IsDivisibleBy(n)` to match a number divisible by `n`.
it_it: Definisce un matcher `IsDivisibleBy(n)` per trovare la corrispondenza con un numero divisibile per `n`.

source: Defines a matcher `IsEven()` to match an even number.
it_it: Definisce un matcher `IsEven()` per abbinare un numero pari.

source: Defines a mock method *`method_name`* with arguments `(`*`args...`*`)` and return type *`return_type`* within a mock class.
it_it: Definisce un metodo mock *`method_name`* con argomenti `(`*`args...`*`)` e tipo restituito *`return_type`* all'interno di una classe mock.

source: Defines a mock method method_name with arguments (args...) and return type return_type within a mock class.
it_it: Definisce un metodo mock method_name con argomenti (args...) e tipo restituito return_type all'interno di una classe mock.

source: Defines a parameterized action Foo(p1, ..., pk) to execute the given statements.
it_it: Definisce un'azione parametrizzata Foo(p1, ..., pk) per eseguire gli statements specificati.

source: Defines a parameterized action `Foo(p1, ..., pk)` to execute the given `statements`.
it_it: Definisce un'azione parametrizzata `Foo(p1, ..., pk)` per eseguire gli `statements` specificati.

source: Defines a type-parameterized test suite based on the test fixture TestFixtureName.
it_it: Definisce test suite con tipi parametrizzati basata sulla fixture TestFixtureName.

source: Defines a type-parameterized test suite based on the test fixture *`TestFixtureName`*.
it_it: Definisce test suite con tipi parametrizzati basata sulla fixture *`TestFixtureName`*.

source: Defines a typed test suite based on the test fixture *`TestFixtureName`*.
it_it: Definisce una test suite tipizzata in base alla fixture *`TestFixtureName`*.

source: Defines a typed test suite based on the test fixture TestFixtureName.
it_it: Definisce una test suite tipizzata in base alla fixture TestFixtureName.

source: Defines an action Plus(n) to return the sum of the mock function's argument #0 and n.
it_it: Definisce un'azione Plus(n) per restituire la somma degli argomenti #0 e n.

source: Defines an action Sum() to return the sum of the mock function's argument #0 and #1.
it_it: Definisce un'azione Sum() per restituire la somma degli argomenti #0 e #1 della funzione mock.

source: Defines an action `Plus(n)` to return the sum of the mock function's argument #0 and `n`.
it_it: Definisce un'azione `Plus(n)` per restituire la somma degli argomenti #0 e `n`.

source: Defines an action `Sum()` to return the sum of the mock function's argument #0 and #1.
it_it: Definisce un'azione `Sum()` per restituire la somma degli argomenti #0 e #1 della funzione mock.

source: Defines an individual test named *`TestName`* in the test suite *`TestSuiteName`*, consisting of the given statements.
it_it: Definisce un singolo test denominato *`TestName`* nella test suite *`TestSuiteName`*, costituito dalle determinate istruzioni.

source: Defines an individual test named *`TestName`* that uses the test fixture class *`TestFixtureName`*.
it_it: Definisce un singolo test denominato *`TestName`* che usa la classe fixture *`TestFixtureName`*.

source: Defines an individual test named TestName in the test suite TestSuiteName, consisting of the given statements.
it_it: Definisce un singolo test denominato TestName nella test suite TestSuiteName, costituito dalle determinate istruzioni.

source: Defines an individual test named TestName that uses the test fixture class TestFixtureName.
it_it: Definisce un singolo test denominato TestName che usa la classe fixture TestFixtureName.

source: Defines an individual type-parameterized test named *`TestName`* in the type-parameterized test suite *`TestSuiteName`*.
it_it: Definisce un singolo test con tipi parametrizzati *`TestName`* nella test suite con tipi parametrizzati *`TestSuiteName`*.

source: Defines an individual type-parameterized test named TestName in the type-parameterized test suite TestSuiteName.
it_it: Definisce un singolo test con tipi parametrizzati TestName nella test suite con tipi parametrizzati TestSuiteName.

source: Defines an individual typed test named *`TestName`* in the typed test suite *`TestSuiteName`*.
it_it: Definisce un singolo test tipizzato denominato *`TestName`* nella test suite tipizzata *`TestSuiteName`*.

source: Defines an individual typed test named TestName in the typed test suite TestSuiteName.
it_it: Definisce un singolo test tipizzato denominato TestName nella test suite tipizzata TestSuiteName.

source: Defines an individual value-parameterized test named *`TestName`* that uses the test fixture class *`TestFixtureName`*.
it_it: Definisce un singolo test con valori parametrizzati denominato *`TestName`* che usa la classe fixture *`TestFixtureName`*.

source: Defines an individual value-parameterized test named TestName that uses the test fixture class TestFixtureName.
it_it: Definisce un singolo test con valori parametrizzati denominato TestName che usa la classe fixture TestFixtureName.

source: Defines what happens when the method *`method_name`* of the object *`mock_object`* is called with arguments that match the given matchers *`matchers...`*.
it_it: Definisce cosa succede quando il metodo *`method_name`* dell'oggetto *`mock_object`* viene chiamato con argomenti che corrispondono ai *`matchers...`* specificati.

source: Defines what happens when the method method_name of the object mock_object is called with arguments that match the given matchers matchers....
it_it: Definisce cosa succede quando il metodo method_name dell'oggetto mock_object viene chiamato con argomenti che corrispondono ai matchers... specificati.

source: Defining Actions
it_it: Definizione delle Action

source: Defining Event Listeners
it_it: Definire i Listener degli Eventi

source: Defining Matchers
it_it: Definizione dei Matcher

source: Defining a Custom Matcher Class {#CustomMatcherClass}
it_it: Definizione di una Classe Matcher Custom {#CustomMatcherClass}

source: Defining a Mock Class
it_it: Definizione di una Classe Mock

source: Defining matchers used to be somewhat more complicated, in which it required several supporting classes and virtual functions.
it_it: La definizione dei matcher era un po' più complicata, in quanto richiedeva diverse classi di supporto e funzioni virtuali.

source: Delegating Calls to a Fake {#DelegatingToFake}
it_it: Delegare le Chiamate ad una Fake {#DelegatingToFake}

source: Delegating Calls to a Parent Class
it_it: Delegare le Chiamate a una Classe Genitore

source: Delegating Calls to a Real Object
it_it: Delegare le Chiamate all'Oggetto Reale

source: Delete the N-th (0-based) argument, which must be a pointer.
it_it: Esegue il delete dell'argomento N-esimo (in base 0), che deve essere un puntatore.

source: Delete the `N`-th (0-based) argument, which must be a pointer.
it_it: Esegue il delete dell'argomento `N`-esimo (in base 0), che deve essere un puntatore.

source: Deletes the fixture.
it_it: Cancella la fixture.

source: Depending on the nature of the leak, it may or may not be worth fixing - so keep this in mind if you get a heap checker error in addition to assertion errors.
it_it: A seconda della natura del leak, potrebbe valere o meno la pena risolverlo, quindi lo si tenga a mente se si riceve un errore sul controllo dell'heap oltre agli errori dell'asserzione.

source: Deprecated.
it_it: Deprecato.

source: Derive a class MockTurtle from Turtle.
it_it: Derivare una classe MockTurtle da Turtle.

source: Derive a class `MockTurtle` from `Turtle`.
it_it: Derivare una classe `MockTurtle` da `Turtle`.

source: Derive a class from testing::Test .
it_it: Si deriva una classe da testing::Test .

source: Derive a class from `testing::Test` .
it_it: Si deriva una classe da `testing::Test` .

source: Describes a parameter to a value-parameterized test.
it_it: Descrive un parametro per un test con valori parametrizzati.

source: Description
it_it: Descrizione

source: Despite the improved thread safety afforded by the "threadsafe" style of death test, thread problems such as deadlock are still possible in the presence of handlers registered with pthread_atfork(3).
it_it: Nonostante la migliorata sicurezza dei thread offerta dallo stile del death test "threadsafe", problemi dei thread come deadlock sono ancora possibili in presenza di gestori registrati con pthread_atfork(3).

source: Despite the improved thread safety afforded by the "threadsafe" style of death test, thread problems such as deadlock are still possible in the presence of handlers registered with `pthread_atfork(3)`.
it_it: Nonostante la migliorata sicurezza dei thread offerta dallo stile del death test "threadsafe", problemi dei thread come deadlock sono ancora possibili in presenza di gestori registrati con `pthread_atfork(3)`.

source: Destroy the mock yourself, or let the code under test destroy it.
it_it: Distruggere il mock manualmente o lasciare che sia il codice sotto test a farlo.

source: Detailed documentation about the framework is available from the Google site.
it_it: La documentazione dettagliata sul framework è disponibile sul sito di Google.

source: Detecting Test Premature Exit
it_it: Rilevare le Uscite Premature dei Test

source: Did you mess up the order of the EXPECT_CALLs?
it_it: È sbagliato l'ordine delle EXPECT_CALL?

source: Did you mess up the order of the `EXPECT_CALL`s?
it_it: È sbagliato l'ordine delle `EXPECT_CALL`?

source: Did you spell it as Setup()?
it_it: È stato scritto Setup()?

source: Did you spell it as `Setup()`?
it_it: È stato scritto `Setup()`?

source: Different projects may need to use Concrete in different ways, so the best interfaces for them will be different.
it_it: Progetti diversi potrebbero dover utilizzare Concrete in modi diversi, quindi le interfacce migliori per loro saranno diverse.

source: Different projects may need to use `Concrete` in different ways, so the best interfaces for them will be different.
it_it: Progetti diversi potrebbero dover utilizzare `Concrete` in modi diversi, quindi le interfacce migliori per loro saranno diverse.

source: Different shards must be assigned different indices, which must be in the range [0, GTEST_TOTAL_SHARDS - 1].
it_it: A shard diversi devono essere assegnati indici diversi, che devono essere compresi nell'intervallo [0, GTEST_TOTAL_SHARDS - 1].

source: Different shards must be assigned different indices, which must be in the range `[0, GTEST_TOTAL_SHARDS - 1]`.
it_it: A shard diversi devono essere assegnati indici diversi, che devono essere compresi nell'intervallo `[0, GTEST_TOTAL_SHARDS - 1]`.

source: Disabling Catching Test-Thrown Exceptions
it_it: Disabilitare la Cattura di Eccezioni Test-Thrown

source: Disabling a test temporarily
it_it: Disabilitare temporaneamente un test

source: Disallowing Unexpected Calls
it_it: Evitare Chiamate [Unexpected]

source: Distributing Test Functions to Multiple Machines
it_it: Distribuire le Funzioni di Test su Più Macchine

source: Do all actions a1 to an and return the result of an in each invocation.
it_it: Esegue tutte le azioni da a1 a an e restituisce il risultato di an in ogni invocazione.

source: Do all actions `a1` to `an` and return the result of `an` in each invocation.
it_it: Esegue tutte le azioni da `a1` a `an` e restituisce il risultato di `an` in ogni invocazione.

source: Do not alternate between calls to EXPECT_CALL() and calls to the mock functions, and do not set any expectations on a mock after passing the mock to an API.
it_it: Non alternare le chiamate a EXPECT_CALL() e le chiamate alle funzioni mock e non impostare alcuna expectation su un mock dopo averlo passato a un'API.

source: Do not alternate between calls to `EXPECT_CALL()` and calls to the mock functions, and do not set any expectations on a mock after passing the mock to an API.
it_it: Non alternare le chiamate a `EXPECT_CALL()` e le chiamate alle funzioni mock e non impostare alcuna expectation su un mock dopo averlo passato a un'API.

source: Do not set new expectations after verifying and clearing a mock after its use.
it_it: Non stabilire nuove expectation dopo aver verificato e ripulito un mock dopo il suo utilizzo.

source: Do the default action (specified by ON_CALL() or the built-in one).
it_it: Esegue l'azione di default (specificata da ON_CALL() o quella nativa).

source: Do the default action (specified by `ON_CALL()` or the built-in one).
it_it: Esegue l'azione di default (specificata da `ON_CALL()` o quella nativa).

source: Does not work when the test parameter is a std::string or C string.
it_it: Non funziona quando il parametro di test è una std::string o una stringa C.

source: Does not work when the test parameter is a `std::string` or C string.
it_it: Non funziona quando il parametro di test è una `std::string` o una stringa C.

source: Does pointer equality on pointers.
it_it: Fa l'uguaglianza dei puntatori sui puntatori.

source: Does the class (hopefully a pure interface) you are mocking have a virtual destructor?
it_it: La classe (si spera un'interfaccia pura) che si sta mock-ando ha un distruttore virtuale?

source: Doing so will lead to ugly compiler errors.
it_it: Ciò porterà a brutti errori del compilatore.

source: Don't expect making a mock nice to change the test's result.
it_it: Non ci si aspetti che rendere un mock "nice" possa cambiare il risultato del test.

source: Don't report leaked mock objects as failures.
it_it: Non segnalare gli oggetti mock [leaked] come fallimenti.

source: Don't use Property() against member functions that you do not own, because taking addresses of functions is fragile and generally not part of the contract of the function.
it_it: Non utilizzare Property() con funzioni membro che non si possiedono, perché prendere gli indirizzi delle funzioni è fragile e generalmente non fa parte del contratto della funzione.

source: Don't use `Property()` against member functions that you do not own, because taking addresses of functions is fragile and generally not part of the contract of the function.
it_it: Non usare `Property()` contro funzioni membro che non si possiedono, perché prendere gli indirizzi delle funzioni è "fragile" e generalmente non fa parte del contratto della funzione.

source: Due to well-known problems with forking in the presence of threads, death tests should be run in a single-threaded context.
it_it: A causa dei noti problemi con il forking in presenza dei thread, i death test dovrebbero essere eseguiti in un contesto a thread singolo.

source: Due to a known issue, unexpected calls on mocks without default actions don't print out a detailed comparison between the actual arguments and the expected arguments.
it_it: A causa di un problema noto, le chiamate impreviste ai mock senza azioni di default non stampano un confronto dettagliato tra gli argomenti effettivi e quelli previsti.

source: Due to a peculiarity of C++, in order to support the syntax for streaming messages to an ASSERT_*, e.g.
it_it: A causa di una peculiarità del C++, per supportare la sintassi per lo streaming dei messaggi su un ASSERT_*, ad es.

source: Due to a peculiarity of C++, in order to support the syntax for streaming messages to an `ASSERT_*`, e.g.
it_it: A causa di una peculiarità del C++, per supportare la sintassi per lo streaming dei messaggi su un `ASSERT_*`, ad es.

source: Due to an implementation detail, you cannot place multiple death test assertions on the same line; otherwise, compilation will fail with an unobvious error message.
it_it: A causa di un dettaglio implementativo, non è possibile inserire più asserzioni di death test sulla stessa riga; in caso contrario la compilazione fallirà con un messaggio di errore non evidente.
